In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv("nyc-rolling-sales-clean.csv")

In [3]:
df.head()

,Unnamed: 0,Unnamed: 0.1,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,EASE-MENT,BUILDING CLASS AT PRESENT,...,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,price,SALE DATE
0,0,4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,,C2,...,5,0,5,1633,6440,1900,2,C2,6625000,7/19/2017 0:00
1,1,5,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,,C7,...,28,3,31,4616,18690,1900,2,C7,-,12/14/2016 0:00
2,2,6,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,,C7,...,16,1,17,2212,7803,1900,2,C7,-,12/9/2016 0:00
3,3,7,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,,C4,...,10,0,10,2272,6794,1913,2,C4,3936272,9/23/2016 0:00
4,4,8,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,,C2,...,6,0,6,2369,4615,1900,2,C2,8000000,11/17/2016 0:00

In [4]:
df['price'].fillna(0)

0         6625000
1             -
2             -
3         3936272
4         8000000
           ...
84543      450000
84544      550000
84545      460000
84546    11693337
84547       69300
Name: price, Length: 84548, dtype: object

In [5]:
df['price']

0         6625000
1             -
2             -
3         3936272
4         8000000
           ...
84543      450000
84544      550000
84545      460000
84546    11693337
84547       69300
Name: price, Length: 84548, dtype: object

In [6]:
for i in range(len(df['price'])):
    if '-' in df['price'][i]:
        df['price'][i] = 0

In [7]:
df['price']

0         6625000
1               0
2               0
3         3936272
4         8000000
           ...
84543      450000
84544      550000
84545      460000
84546    11693337
84547       69300
Name: price, Length: 84548, dtype: object

In [8]:
df['price'].astype(np.int64)

0         6625000
1               0
2               0
3         3936272
4         8000000
           ...
84543      450000
84544      550000
84545      460000
84546    11693337
84547       69300
Name: price, Length: 84548, dtype: int64

In [9]:
df.to_csv('nyc-rolling-sales-clean_v2.csv')

In [10]:
df.head()

,Unnamed: 0,Unnamed: 0.1,BOROUGH,NEIGHBORHOOD,BUILDING CLASS CATEGORY,TAX CLASS AT PRESENT,BLOCK,LOT,EASE-MENT,BUILDING CLASS AT PRESENT,...,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,BUILDING CLASS AT TIME OF SALE,price,SALE DATE
0,0,4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,,C2,...,5,0,5,1633,6440,1900,2,C2,6625000,7/19/2017 0:00
1,1,5,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,,C7,...,28,3,31,4616,18690,1900,2,C7,0,12/14/2016 0:00
2,2,6,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,,C7,...,16,1,17,2212,7803,1900,2,C7,0,12/9/2016 0:00
3,3,7,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,,C4,...,10,0,10,2272,6794,1913,2,C4,3936272,9/23/2016 0:00
4,4,8,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,,C2,...,6,0,6,2369,4615,1900,2,C2,8000000,11/17/2016 0:00

In [11]:
max(df['price'])

TypeError: '>' not supported between instances of 'int' and 'str'